const information = {
    file0: {
        title: "Аркадий любит стаяк Раналда",
        desc: "У Аркадия есть крутой стаяк Раналда это круто я такое конечно же поддерживаю.",
        tags: ["роналдо"]
    },
    file1: {
        title: "Аркадий был на острове Эпштейна",
        desc: "Аркадий еще в ■■■■ году посещал остров Эпштейна. Он прилетел туда и конечно же поздоровался со свои " +
            "любимым дядей Эпштейном. Затем Аркадий ■■■■■ ■■■■■ ■■■■■. Ему очень понравилось, дальше он неоднократно " +
            "посещал данный чудо-остров.",
        picture: ["images/img0.jpg"]
    },
    file2: {
        title: "ЕГЭ по химбио",
        desc: "Аркадий написал ЕГЭ по химбио на 49 баллов это является показателем невероятного интеллекта и " +
            "образованности. Те, кто написал на больший балл писали чисто на лаке и вообще это не считается, " +
            "не то что Аркадий."
    },
    file3: {
        title: "Аскар Бурнашев трогает Игоря за яйца. Ему не нравится",
        desc: "Это просто ужас кошмар какой-то. Надеюсь с человеком все в порядке это просто что-то за гранью...",
        picture: ["images/img3.jpg"],
        tags: ["игорь", "лукащук", "катя", "мудилова", "мурзинова"]
    },
    file4: {
        title: "Аркадий - пример того, как можно уметь все",
        desc: "Говорили: «Знать все невозможно». Аркадий полное опровержение этого высера. Он умеет все. " +
            "От дирижирования до управления стояком раналда. Это невероятно."
    },
    file5: {
        title: "Лева лично встретился с Раналда и Тун Тун Пиздун",
        desc: "Лева лично знаком с раналда и тун тун захуем это правда не фейк прикиньте",
        picture: ["images/img1.jpg", "images/img2.jpg"],
        tags: ["лукащук", "роналдо", "лев", "лёва"]
    },
    file6: {
        title: "Тиханькин трясет своим пузом перед детьми",
        desc: "Выяснилось, что Тиханькин поступил в лицей не для учебы и хорошего образования, а для немного иных целей. " +
            "Вот сразу видно кто из 109ой",
        picture: ["images/img4.jpg"],
        tags: ["артем", "артём", "тиханкин"]
    },
    file7: {
        title: "Миша играет на балалайке",
        desc: "Давно в тиктоке было выложено видео, где Михаил играет на балалайке в виде мужского детородного органа. " +
            "Миша пытался доказать, что он не причастен к этому и на видео совершенно другой человек. Но факты говорят " +
            "обратное. Однако, видео было утеряно в глубинах интернета и, вероятно, удалено. Возможно, в этом замешан " +
            "сам Михаил дабы спрятать неугодный материал.",
        picture: ["images/img5.jpg"],
        tags: ["михаил"]
    },
    file8: {
        title: "Юрок в парке победы",
        desc: "Юра пришел погулять в парк победы, но почему-то решил, что это его родной обезъянник и начал залезать на различные сооружения.",
        picture: ["images/img6.jpg"],
        tags: ["юра", "волков", "юрий"]
    },
    file9: {
        title: "Игорь любит физику",
        desc: "Игорь - Великий физик нашего времени. Поздно вернувшись домой после 25-часового занятия физикой за 67 класс, он трахнул учебник физики.",
        tags: ["лукащук"],
        picture: ["images/img7.jpg"]
    },
    file10: {
        title: "Остров Аркадия",
        desc: "Где-то в океане существует Великий остров Аркадия, на котором происходит всё веселье. На данный момент неизвестно его настоящее название и точное местоположение.",
        picture: ["images/img8.jpg"]
    },
    file11: {
        title: "Песня про газика",
        desc: "Возле школы выпал град - это Газик виноват.<br>" +
            "Не читается лит-ра - это Газика вина.<br>" +
            "Миша чай радмирин пьет - это Газик в глотку льет.<br>" +
            "Под лицеем ветер дует - Газик видимо колдует",
        tags: ["руслан", "газимов"]
    },
    file12: {
        title: "Юра написал докладную на Радмира, Лукащуков и Тиханькина",
        desc: "Юрец обвиняет четверых людей в том, что они поздравляли его с днем дурака<br>(это правда). Оригинальное сообщение ниже.",
        picture: ["images/img9.jpg"],
        tags: ["волков", "юрий"]
    },
    file13: {
        title: "Компания «Три Медведя»",
        desc: "В начале 7 класса была очень распространена компания под названием Три Медведя. Генеральным директором этой компании был Радмир, а его заместителем - Алексей. " +
            "Они произоводили некий «товар». В него они пихали раздробленую гречку, стружку от карандаша и прочие вкусняшки. Товар обменивался на разные предметы. " +
            "Сейчас компания неактивна. (Также работники и те, кто были связаны с компанией: Нурисламов Руслан, Лев, Александр)",
        tags: ["радмир", "леша", "алексей", "саня", "саша", "александр", "лев", "нурисламов", "нурисламов руслан", "руслан"],
        picture: ["images/img10.jpg"]
    },
    file14: {
        title: "Новогодняя о■■■я на хате у Радмира",
        desc: "На кануне Нового года в 2025 году Радмир стал приглашать всех на свою вторую квартиру, чтобы повесилиться. Леша даже скинул 10 рублей на кириешки, " +
            "но потом они были возвращены обратно. Однажды, непонятно как, дома у Радмира появилась 8летняя девочка. Она сразу привлекла внимание Аркаши и он ее в■■■■■. " +
            "Аркадию очень понравилось.",
        tags: ["аркадий", "леша", "алексей"],
        picture: ["images/img11.jpg"]
    },
    file15: {
        title: "Леша боится душа",
        desc: "В один день Алексей пошутил, что не мылся уже 3 года. Позже выяснилось, что это была не шутка...",
        tags: ["алексей"],
        picture: ["images/img12.jpg"]
    },
    file16: {
        title: "Амелия разозлилась",
        desc: "В один из самых обычных дней раздавали результаты самостоятельных по алгебре. По всей видимости Амелии не понравился результат и в нее вселился арийский дух.",
        picture: ["images/img13.jpg"]
    },
    file17: {
        title: "Алексей создатель сайта",
        desc: "Алексей главный разработчик данного невероятного сайта про файлы Аркадия. Я без понятия зачем вам эта информация, но зато вы теперь точно знаеете кого бить за школой",
        tags: ["леша"]
    },
    file18: {
        title: "Чей-то рюкзак был обнаружен в толчке",
        desc: "Леша просто решил поссать и пошел в ближайший туалет. Но его желание писять перебил портфель, который лежал прямо на унитазе.",
        tags: ["леша", "алексей"],
        picture: ["images/img14.jpg"]
    },
    file19: {
        title: "Два дауна",
        desc: "Нурисламов Русланчик и Леша снова делают всякую херню и смеются с этого. База 109ых",
        tags: ["нурисламов", "нурисламов руслан", "руслан", "леша", "алексей"],
        picture: ["images/img15.jpg"]
    },
    file20: {
        title: "Лева купил квас",
        desc: "После физры все как обычно, по традиции, закупались едой, чтобы потом жрать на музыке. Но в один из этих прекрасных дней Лев решил не скромничать " +
            "и купил квас.",
        tags: ["лев", "лукащук"],
        picture: ["images/img16.jpg"]
    },
    file21: {
        title: "Сменка застряла на дереве",
        desc: "Неизвестно каким образом сменка повисла на ветке и все пытались ее снять. Благо вовремя появился Михаил и помог достать сменку палкой",
        tags: ["миша", "михаил"],
        picture: ["images/img17.jpg"]
    },
    file22: {
        title: "Правила мужского туалета",
        desc: "В верхнем мужском туалете неизвестными людьми были размещены правила. Позже, их прям на глазах у учеников снял учитель, который мыл руки.",
        picture: ["images/img18.jpg"]
    },
    file23: {
        title: "Фотография Эпштейна и трампа",
        desc: "В мужском туалете была размещена знаменитая фотография Эпштейна с Трампом. Разместил ее Михаил, а радмир распечатал это невероятное фото. " +
            "Позже, к сожалению фотография была снята.",
        tags: ["михаил", "радмир", "миша"],
        picture: ["images/img19.jpg"]
    },
    file24: {
        title: "Клуб Лебедушек",
        desc: "Однажды Елена Евгеньевна отметила, что мальчики ведут себя странно на переменах. Она пошутила, что мы постоянно друг к другу лезем и обнимаемся и прозвала нас лебедушками. " +
            "Это и стало причиной создания клуба Лебедушек. Главные участники клуба: Лев, Нурисламов Руслан и Леша",
        tags: ["леша", "алексей", "лев", "лукащук", "нурисламов", "руслан", "нурисламов руслан"],
        picture: ["images/img20.jpg"]
    },
    file25: {
        title: "Мина на стуле",
        desc: "Однажды, Радмир решил, что будет прекрасной идеей положить противотанковую мину на стул Михаила. Он так и сделал",
        tags: ["миша", "радмир", "михаил"],
        picture: ["images/img21.jpg"]
    },
    file26: {
        title: "Глебика смачно отымели в зад",
        desc: "В самый обыный день пацаны устраивали жоскую о■■■ю. В ней конечно же участвовал Глеб. Только все пошло не по плану и он узнал что такое двойное осеменение.",
        picture: ["images/img22.jpg"]
    },
    file27: {
        title: "Атака на еду Радмира",
        desc: "Радмир после третьего урока отказался давать еду Михаилу и Алексею. Они разозлились. Это перетекло в целую " +
            "войну в которую присоединился Нурисламов Руслан на стороне Миши и Леши, а также какой-то малолетка на стороне Радмира",
        picture: ["images/img23.jpg"],
        tags: ["миша", "михаил", "нурисламов", "нурисламов руслан", "руслан", "леша", "алексей"]
    },
    file28: {
        title: "Игорь накурился и закосплеил троллфейс манго эдит",
        desc: "Чел реально красава респект ему плюс лит енержи годжу сатуру манго манго фонк эдит ютуб кидс",
        picture: ["images/img24.jpg"],
        tags: ["игорь", "лукащук"]
    },
    file29: {
        title: "Нашли справку Михаила о том, что он спидозник",
        desc: "Супер скрытная разведка решил проверить, что находится в рюкзаке Михаила. Раскрылась его самая главная тайна. Михаил давно болеет СПИДом. " +
            "Делая «помазики», он заражает других людей данной болезнью.",
        picture: ["images/img25.jpg"],
        tags: ["миша"]
    },
    file30: {
        title: "Русланчик решил, что он фог",
        desc: "На уроке семьеразведения руслан окончательно сошел с ума и начал нападать на друнов. На фото ниже представлены последние секунды жизни ч.",
        picture: ["images/img26.jpg"],
        tags: ["нурисламов", "руслан", "нурисламов руслан"]
    },
    file31: {
        title: "Миньон повесился",
        desc: "Миньоны годами помогали Наполеону в войнах, но не выдержали и дня в обществе физматов. Помним, любим, скайрим...",
        picture: ["images/img27.jpg"]
    }
}

function search() {
    const inputField = document.getElementById("inputSearch");
    const searchValue = inputField.value.toLowerCase().trim();
    let results = [], searchedFiles = [];

    function createFiles(obj) {
        if (!(searchedFiles.includes(obj))) {
            if (!('picture' in obj)) {
                results.push(`<div class='block'><h1>${obj.title}</h1><p class="desc">${obj.desc}</p></div>`);
                searchedFiles.push(obj)
            } else {
                let image_block = ``;
                for (let i in obj.picture) {
                    image_block = image_block + `<img src="${obj.picture[i]}" alt="" class="infImage">`
                }
                results.push(`<div class='block'><h1>${obj.title}</h1><p class="desc">${obj.desc}</p><div class="imageBlock">${image_block}</div></div>`);
                searchedFiles.push(obj)
            }
        }
    }

    for (let key in information) {
        let obj = information[key];
        if (obj.title.toLowerCase().includes(searchValue)) {
            createFiles(obj)
        }
        if ('tags' in obj) {
            if (obj.tags.includes(searchValue)) {
                createFiles(obj)
            }
        }
    }

    const searchContent = document.getElementById("searchContent");
    // const counter = document.getElementById("count");
    results.reverse();

    if (results.length > 0 && searchValue) {
        // counter.innerHTML = "<p>Найдено результатов: " + results.length + "</p>";
        searchContent.innerHTML = results.join("");
    } else {
        searchContent.innerHTML = "<p class='nothing'>Ничего не найдено</p>";
    }
}